{
    "intents": [
      {
        "tag": "greeting",
        "patterns": [
          "Hi",
          "Hey",
          "How are you",
          "Is anyone there?",
          "Hello",
          "Good day"
        ],
        "responses": [
          "Hey, I'm Carbon, your Ministry of Coal assistant. How can I assist you today?",
          "Hello! Welcome to the Ministry of Coal chatbot. I'm Carbon. How can I help you?",
          "Hi there, I'm Carbon. How can I assist you with coal-related queries?",
          "Hello, thanks for reaching out. I'm Carbon. How can I be of service today?"
        ]
      },

      {
        "tag": "information request",
        "patterns":["Tell me about coal production.","What are the coal policies in India?","Explain the process of coal mining.","Can you provide coal industry statistics?"],
        "responses":["Sure, I can provide information on various aspects of coal production and policies in India. What specific information are you looking for?","Of course, I can assist you with information related to coal mining and policies. Please specify your query.","Certainly, I can explain the coal mining process or share statistics. What would you like to know more about?","Absolutely, I can provide coal industry statistics and related details. What specific data are you interested in?"]
      },
      {
        "tag": "procedure guidance",
        "patterns":["How do I apply for a coal mining license?","What are the steps to obtain a coal transportation permit?","license apply"],
        "responses":["I can guide you through the process of applying for a coal mining license or obtaining a transportation permit. Which one would you like to learn about?"]
      },
      {
        "tag": "function",
        "patterns":["purpose","function","what can you do","what are you for","what is your purpose","in what ways you can help me"],
        "responses":["I am a chatbot created by the Indian Ministry of Coal to assist you with information related to coal production, policies, and initiatives"]
      },

      {
        "tag": "thanks",
        "patterns": ["Thanks", "Thank you", "That's helpful", "Thank's a lot!"],
        "responses": ["Happy to help!", "Any time!", "My pleasure"]
      },
     
         
      {
        "tag": "funny",
        "patterns": [
          "Tell me a joke!",
          "Tell me something funny!",
          "Do you know a joke?"
        ],
        "responses": [
          "Why did the hipster burn his mouth? He drank the coffee before it was cool.",
          "What did the buffalo say when his son left for college? Bison."
        ]
      }
    ]
  }